# utilities
brew "zoxide" # better cd
brew "eza" # better ls
brew "bat" # better cat
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "htop" # a top alternative
brew "neovim" # A better vim
brew "tree-sitter" # Better code highlighting for neovim
brew "ripgrep" # very fast file searcher
brew "tmux" # terminal multiplexer
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
brew "lazygit" # terminal UI for git

# GUI
cask "logi-options+"
cask "google-chrome"
cask "messenger"
cask "discord"
cask "whatsapp"

## Coding
cask "visual-studio-code"
cask "ghostty" 

# Fonts

cask "font-geist-mono-nerd-font"