# utilities
brew "stow" # symlink manager
brew "zoxide" # better cd
brew "eza" # better ls
brew "bat" # better cat
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "neovim" # A better vim
brew "tree-sitter" # Better code highlighting for neovim
brew "ripgrep" # very fast file searcher
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
brew "lazygit" # terminal UI for git
brew "starship" # A prompt for zsh
brew "yt-dlp" # A youtube videos downloader
brew "ffmpeg" # A video manipulation library and program

# GUI
cask "antigravity"
cask "helium-browser"
cask "rectangle"
cask "figma"
cask "stats"
cask "iina"
cask "keepingyouawake"
cask "logi-options+"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "openvpn-connect"
cask "orbstack"
cask "qbittorrent"
cask "rectangle"
cask "spotify"
cask "teamviewer"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"

# Coding
brew "libpq"
tap  "oven-sh/bun"
brew "oven-sh/bun/bun"
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"
brew "uv"
brew "fnm"
brew "just"

# Fonts

cask "font-geist-mono-nerd-font"
tap "shaunsingh/SFMono-Nerd-Font-Ligaturized"
cask "font-sf-mono-nerd-font-ligaturized"
