# utilities
brew "stow" # symlink manager
brew "zoxide" # better cd
brew "eza" # better ls
brew "bat" # better cat
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "neovim" # A better vim
brew "tree-sitter" # Better code highlighting for neovim
brew "ripgrep" # very fast file searcher
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
brew "lazygit" # terminal UI for git
brew "starship" # A prompt for zsh

# GUI
cask "logi-options+"
cask "google-chrome"
cask "firefox"
cask "messenger"
cask "discord"
cask "whatsapp"
cask "slack"
cask "appcleaner"
cask "obsidian"
cask "raycast"
cask "handbrake"
cask "spotify"

## Coding
cask "visual-studio-code"
cask "ghostty" 
cask "tableplus"
cask "orbstack"

tap  "oven-sh/bun"
brew "oven-sh/bun/bun"

# Golang
brew "go"

brew "fnm"

# Fonts

cask "font-geist-mono-nerd-font"
