# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "stow" # gnu utility for managing dotfiles
brew "trash" # rm, but put in the trash rather than completely delete

cask "pika"
cask "visual-studio-code"

# Fonts
# cask "font-fira-code"
# cask "font-jetbrains-mono"
# cask "font-cascadia-mono"
# cask "font-3270-nerd-font"

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "eza" # better ls
brew "bat" # better cat
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "htop" # a top alternative
brew "neovim" # A better vim
brew "tree-sitter" # Better code highlighting for neovim
brew "pyenv" # A python environment manager
brew "ripgrep" # very fast file searcher
brew "tmux" # terminal multiplexer
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "yt-dlp" # utility to download YouTube videos (formally `youtube-dl`)
brew "starship" # zsh prompt

## JS Development
brew "fnm" # Fast Node version manager
tap "oven-sh/bun"
brew "bun"

cask "mpv"
brew "ffmpeg"
cask "handbrake"
